experiments/socialnetwork_4node/expected_results/qps9000/wrk.log
Running 2m test @ http://ip-172-31-8-223.us-east-2.compute.internal:8080
  4 threads and 96 connections
  Thread calibration: mean lat.: 3.249ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 3.264ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 3.300ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 3.267ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.31ms    1.73ms  28.90ms   68.09%
    Req/Sec     2.36k   239.41     3.60k    69.99%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.60ms
 75.000%    4.93ms
 90.000%    5.95ms
 99.000%    7.48ms
 99.900%   10.38ms
 99.990%   15.86ms
 99.999%   25.39ms
100.000%   28.91ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.710     0.000000            1         1.00
       1.637     0.100000       126006         1.11
       1.905     0.200000       252078         1.25
       2.129     0.300000       378532         1.43
       2.351     0.400000       504123         1.67
       2.599     0.500000       629891         2.00
       2.749     0.550000       692712         2.22
       2.935     0.600000       755375         2.50
       3.219     0.650000       818565         2.86
       4.171     0.700000       881272         3.33
       4.935     0.750000       944519         4.00
       5.123     0.775000       975827         4.44
       5.287     0.800000      1007246         5.00
       5.443     0.825000      1038765         5.71
       5.599     0.850000      1070107         6.67
       5.767     0.875000      1102156         8.00
       5.851     0.887500      1117327         8.89
       5.947     0.900000      1133487        10.00
       6.047     0.912500      1149253        11.43
       6.159     0.925000      1164901        13.33
       6.283     0.937500      1180553        16.00
       6.351     0.943750      1188121        17.78
       6.427     0.950000      1196063        20.00
       6.515     0.956250      1204156        22.86
       6.607     0.962500      1211789        26.67
       6.723     0.968750      1219768        32.00
       6.787     0.971875      1223616        35.56
       6.859     0.975000      1227457        40.00
       6.943     0.978125      1231453        45.71
       7.047     0.981250      1235365        53.33
       7.171     0.984375      1239360        64.00
       7.243     0.985938      1241293        71.11
       7.323     0.987500      1243282        80.00
       7.415     0.989062      1245185        91.43
       7.535     0.990625      1247162       106.67
       7.687     0.992188      1249096       128.00
       7.771     0.992969      1250074       142.22
       7.875     0.993750      1251073       160.00
       8.011     0.994531      1252053       182.86
       8.167     0.995313      1253033       213.33
       8.367     0.996094      1254007       256.00
       8.503     0.996484      1254504       284.44
       8.647     0.996875      1254984       320.00
       8.815     0.997266      1255486       365.71
       9.031     0.997656      1255974       426.67
       9.279     0.998047      1256464       512.00
       9.455     0.998242      1256703       568.89
       9.623     0.998437      1256947       640.00
       9.863     0.998633      1257195       731.43
      10.103     0.998828      1257442       853.33
      10.415     0.999023      1257695      1024.00
      10.615     0.999121      1257808      1137.78
      10.815     0.999219      1257932      1280.00
      11.087     0.999316      1258056      1462.86
      11.399     0.999414      1258180      1706.67
      11.703     0.999512      1258302      2048.00
      11.887     0.999561      1258362      2275.56
      12.103     0.999609      1258423      2560.00
      12.455     0.999658      1258489      2925.71
      12.767     0.999707      1258547      3413.33
      13.263     0.999756      1258609      4096.00
      13.527     0.999780      1258639      4551.11
      13.879     0.999805      1258669      5120.00
      14.263     0.999829      1258699      5851.43
      14.695     0.999854      1258730      6826.67
      15.135     0.999878      1258761      8192.00
      15.439     0.999890      1258776      9102.22
      15.951     0.999902      1258792     10240.00
      16.279     0.999915      1258807     11702.86
      16.607     0.999927      1258822     13653.33
      17.343     0.999939      1258838     16384.00
      17.695     0.999945      1258845     18204.44
      18.095     0.999951      1258853     20480.00
      18.703     0.999957      1258861     23405.71
      19.519     0.999963      1258869     27306.67
      20.415     0.999969      1258876     32768.00
      23.295     0.999973      1258880     36408.89
      23.871     0.999976      1258885     40960.00
      24.127     0.999979      1258888     46811.43
      24.543     0.999982      1258891     54613.33
      24.831     0.999985      1258895     65536.00
      24.927     0.999986      1258897     72817.78
      25.167     0.999988      1258899     81920.00
      25.391     0.999989      1258901     93622.86
      25.903     0.999991      1258903    109226.67
      26.351     0.999992      1258905    131072.00
      26.367     0.999993      1258906    145635.56
      26.463     0.999994      1258907    163840.00
      26.559     0.999995      1258908    187245.71
      26.751     0.999995      1258909    218453.33
      27.023     0.999996      1258910    262144.00
      27.023     0.999997      1258910    291271.11
      27.279     0.999997      1258911    327680.00
      27.279     0.999997      1258911    374491.43
      27.551     0.999998      1258912    436906.67
      27.551     0.999998      1258912    524288.00
      27.551     0.999998      1258912    582542.22
      27.743     0.999998      1258913    655360.00
      27.743     0.999999      1258913    748982.86
      27.743     0.999999      1258913    873813.33
      27.743     0.999999      1258913   1048576.00
      27.743     0.999999      1258913   1165084.44
      28.911     0.999999      1258914   1310720.00
      28.911     1.000000      1258914          inf
#[Mean    =        3.314, StdDeviation   =        1.731]
#[Max     =       28.896, Total count    =      1258914]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    1.81ms
 75.000%    4.34ms
 90.000%    5.14ms
 99.000%    6.56ms
 99.900%    9.49ms
 99.990%   14.37ms
 99.999%   24.80ms
100.000%   27.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.601     0.000000            1         1.00
       1.133     0.100000       126080         1.11
       1.310     0.200000       252469         1.25
       1.484     0.300000       378131         1.43
       1.637     0.400000       503951         1.67
       1.806     0.500000       629911         2.00
       1.914     0.550000       692502         2.22
       2.063     0.600000       755503         2.50
       2.305     0.650000       818609         2.86
       3.605     0.700000       881261         3.33
       4.339     0.750000       944419         4.00
       4.483     0.775000       976029         4.44
       4.611     0.800000      1007920         5.00
       4.735     0.825000      1039362         5.71
       4.859     0.850000      1070691         6.67
       4.991     0.875000      1101664         8.00
       5.067     0.887500      1117935         8.89
       5.143     0.900000      1133087        10.00
       5.231     0.912500      1149218        11.43
       5.327     0.925000      1165017        13.33
       5.435     0.937500      1180622        16.00
       5.495     0.943750      1188430        17.78
       5.563     0.950000      1196376        20.00
       5.639     0.956250      1204194        22.86
       5.723     0.962500      1211745        26.67
       5.827     0.968750      1219757        32.00
       5.887     0.971875      1223678        35.56
       5.955     0.975000      1227553        40.00
       6.035     0.978125      1231492        45.71
       6.131     0.981250      1235451        53.33
       6.247     0.984375      1239339        64.00
       6.319     0.985938      1241282        71.11
       6.395     0.987500      1243193        80.00
       6.495     0.989062      1245153        91.43
       6.615     0.990625      1247145       106.67
       6.763     0.992188      1249107       128.00
       6.859     0.992969      1250097       142.22
       6.967     0.993750      1251060       160.00
       7.103     0.994531      1252034       182.86
       7.267     0.995313      1253028       213.33
       7.483     0.996094      1253998       256.00
       7.611     0.996484      1254501       284.44
       7.763     0.996875      1254994       320.00
       7.931     0.997266      1255472       365.71
       8.143     0.997656      1255967       426.67
       8.415     0.998047      1256462       512.00
       8.567     0.998242      1256713       568.89
       8.743     0.998437      1256954       640.00
       8.959     0.998633      1257202       731.43
       9.215     0.998828      1257444       853.33
       9.535     0.999023      1257688      1024.00
       9.703     0.999121      1257813      1137.78
       9.887     0.999219      1257933      1280.00
      10.151     0.999316      1258055      1462.86
      10.439     0.999414      1258180      1706.67
      10.743     0.999512      1258302      2048.00
      10.951     0.999561      1258361      2275.56
      11.167     0.999609      1258424      2560.00
      11.455     0.999658      1258485      2925.71
      11.759     0.999707      1258548      3413.33
      12.111     0.999756      1258611      4096.00
      12.359     0.999780      1258638      4551.11
      12.615     0.999805      1258669      5120.00
      12.927     0.999829      1258700      5851.43
      13.511     0.999854      1258730      6826.67
      14.015     0.999878      1258761      8192.00
      14.183     0.999890      1258776      9102.22
      14.431     0.999902      1258792     10240.00
      14.807     0.999915      1258807     11702.86
      15.215     0.999927      1258822     13653.33
      15.887     0.999939      1258838     16384.00
      15.999     0.999945      1258845     18204.44
      16.415     0.999951      1258853     20480.00
      17.183     0.999957      1258861     23405.71
      17.791     0.999963      1258868     27306.67
      19.151     0.999969      1258876     32768.00
      22.607     0.999973      1258880     36408.89
      23.055     0.999976      1258884     40960.00
      23.647     0.999979      1258888     46811.43
      23.711     0.999982      1258891     54613.33
      24.175     0.999985      1258895     65536.00
      24.271     0.999986      1258897     72817.78
      24.591     0.999988      1258899     81920.00
      24.799     0.999989      1258901     93622.86
      25.023     0.999991      1258903    109226.67
      25.135     0.999992      1258905    131072.00
      25.183     0.999993      1258906    145635.56
      25.295     0.999994      1258907    163840.00
      25.727     0.999995      1258908    187245.71
      25.791     0.999995      1258909    218453.33
      26.191     0.999996      1258910    262144.00
      26.191     0.999997      1258910    291271.11
      26.879     0.999997      1258911    327680.00
      26.879     0.999997      1258911    374491.43
      27.055     0.999998      1258912    436906.67
      27.055     0.999998      1258912    524288.00
      27.055     0.999998      1258912    582542.22
      27.375     0.999998      1258913    655360.00
      27.375     0.999999      1258913    748982.86
      27.375     0.999999      1258913    873813.33
      27.375     0.999999      1258913   1048576.00
      27.375     0.999999      1258913   1165084.44
      27.903     0.999999      1258914   1310720.00
      27.903     1.000000      1258914          inf
#[Mean    =        2.621, StdDeviation   =        1.657]
#[Max     =       27.888, Total count    =      1258914]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1349497 requests in 2.50m, 531.59MB read
Requests/sec:   8996.64
Transfer/sec:      3.54MB